nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54628/driver_examples/dmic/dmic_i2s_dma/pin_mux.c
    const uint32_t port4_pin1_config = (/* Pin is configured as FC6_SCK */
                                        IOCON_PIO_FUNC2 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter enabled */
                                        IOCON_PIO_INPFILT_ON |
                                        /* Fast mode, slew rate control is disabled */
                                        IOCON_PIO_SLEW_FAST |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN1 (coords: G14) is configured as FC6_SCK */
    IOCON_PinMuxSet(IOCON, 4U, 1U, port4_pin1_config);

    const uint32_t port4_pin2_config = (/* Pin is configured as FC6_RXD_SDA_MOSI_DATA */
                                        IOCON_PIO_FUNC2 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter enabled */
                                        IOCON_PIO_INPFILT_ON |
                                        /* Fast mode, slew rate control is disabled */
                                        IOCON_PIO_SLEW_FAST |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN2 (coords: F14) is configured as FC6_RXD_SDA_MOSI_DATA */
    IOCON_PinMuxSet(IOCON, 4U, 2U, port4_pin2_config);

    const uint32_t port4_pin3_config = (/* Pin is configured as FC6_TXD_SCL_MISO_WS */
                                        IOCON_PIO_FUNC2 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter enabled */
                                        IOCON_PIO_INPFILT_ON |
                                        /* Fast mode, slew rate control is disabled */
                                        IOCON_PIO_SLEW_FAST |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN3 (coords: F13) is configured as FC6_TXD_SCL_MISO_WS */
    IOCON_PinMuxSet(IOCON, 4U, 3U, port4_pin3_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
